<a href="https://colab.research.google.com/github/JuniaBS/Exercicios_Analise_de_Dados_com_Python/blob/main/Exerc%C3%ADcios_Banco_de_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exercícios Banco de Dados

In [1]:
import sqlite3

conexao = sqlite3.connect('Banco_exercicio')
cursor = conexao.cursor()

1. Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [ ]:
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR (100), idade INT, curso VARCHAR(100));')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (1,"Camila",20, "Direito")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (2,"Alessandra",35, "Engenharia")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (3,"Jessica",25, "Medicina")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (4,"Pedro",40, "Historia")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (5,"Bruno",30, "Engenharia")')

3. Consultas Básicas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos"

In [5]:
dados= cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Camila', 20, 'Direito')
(2, 'Alessandra', 35, 'Engenharia')
(3, 'Jessica', 26, 'Medicina')
(4, 'Pedro', 40, 'Historia')
(1, 'Camila', 20, 'Direito')
(2, 'Alessandra', 35, 'Engenharia')
(3, 'Jessica', 25, 'Medicina')
(4, 'Pedro', 40, 'Historia')
(5, 'Bruno', 30, 'Engenharia')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [6]:
dados= cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
for alunos in dados:
    print(alunos)

('Alessandra', 35)
('Jessica', 26)
('Pedro', 40)
('Alessandra', 35)
('Jessica', 25)
('Pedro', 40)
('Bruno', 30)

c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.

In [7]:
dados = cursor.execute('SELECT nome FROM alunos WHERE curso = "Engenharia" ORDER BY nome ASC')
for alunos in dados:
    print(alunos)

('Alessandra',)
('Alessandra',)
('Bruno',)

d) Contar o número total de alunos na tabela

In [8]:
cursor.execute('SELECT COUNT(*) FROM alunos')
numero_de_alunos = cursor.fetchone()[0]
print(f'O número de alunos é: {numero_de_alunos}')

O número de alunos é: 9

4. Atualização e Remoção

 a) Atualize a idade de um aluno específico na tabela.

In [9]:
cursor.execute('UPDATE alunos SET idade = 26 WHERE nome = "Jessica"')

In [10]:
dados = cursor.execute('SELECT nome, idade FROM alunos WHERE nome = "Jessica"')
for alunos in dados:
    print(alunos)

('Jessica', 26)
('Jessica', 26)

b) Remova um aluno pelo seu ID.

In [11]:
cursor.execute('DELETE FROM alunos WHERE id = 5')

In [12]:
dados= cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Camila', 20, 'Direito')
(2, 'Alessandra', 35, 'Engenharia')
(3, 'Jessica', 26, 'Medicina')
(4, 'Pedro', 40, 'Historia')
(1, 'Camila', 20, 'Direito')
(2, 'Alessandra', 35, 'Engenharia')
(3, 'Jessica', 26, 'Medicina')
(4, 'Pedro', 40, 'Historia')

 5. Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.

In [ ]:
cursor.execute('CREATE TABLE clientes (id INTEGER PRIMARY KEY AUTOINCREMENT, nome VARCHAR (100), idade INT, saldo FLOAT);')

In [14]:
cursor.execute('INSERT INTO clientes (nome, idade, saldo) VALUES ("Maria",25, 1200.00)')
cursor.execute('INSERT INTO clientes (nome, idade, saldo) VALUES ("Pedro",30, 4000.00)')
cursor.execute('INSERT INTO clientes (nome, idade, saldo) VALUES ("Antonio",20, 2501.00)')
cursor.execute('INSERT INTO clientes (nome, idade, saldo) VALUES ("Teresa",36, 5700.00)')

6. Consultas e Funções Agregadas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.

In [15]:
dados= cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
for clientes in dados:
    print(clientes)

('Teresa', 36)
('Teresa', 36)

b) Calcule o saldo médio dos clientes

In [16]:
cursor.execute('SELECT AVG (saldo) FROM clientes')
saldo_medio = cursor.fetchone()[0]
print(f'O saldo médio dos clientes é R$ {saldo_medio:.2f}')

O saldo médio dos clientes é R$ 3043.00

c) Encontre o cliente com o saldo máximo.

In [17]:
# Encontrando o saldo máximo
cursor.execute('SELECT MAX (saldo) FROM clientes')
saldo_maximo = cursor.fetchone()[0]

In [18]:
# Encontrando o cliente com o saldo máximo e imprimindo
cursor.execute('SELECT nome FROM clientes WHERE saldo = ?', (saldo_maximo,))
cliente_max_saldo = cursor.fetchone()
print(f'O nome do cliente com o saldo máximo é {cliente_max_saldo[0]}')

O nome do cliente com o saldo máximo é Teresa

d) Conte quantos clientes têm saldo acima de 1000.

In [19]:
cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1000')
numero_clientes_acima_1000 = cursor.fetchone()[0]
print(f'O número de clientes com saldo acima de R$1000 é de {numero_clientes_acima_1000}')

O número de clientes com saldo acima de R$1000 é de 6

7. Atualização e Remoção com Condições

 a) Atualize o saldo de um cliente específico.

In [20]:
cursor.execute('UPDATE clientes SET saldo = 1000.00 WHERE nome = "Pedro"')

In [21]:
dados = cursor.execute('SELECT saldo FROM clientes WHERE nome = "Pedro"')
cliente_atualizado = cursor.fetchone()[0]
print(f'O saldo atualizado é de R$ {cliente_atualizado:.2f}')

O saldo atualizado é de R$ 1000.00

b) Remova um cliente pelo seu ID.

In [22]:
cursor.execute('DELETE FROM clientes WHERE id = 3')

In [23]:
dados= cursor.execute('SELECT * FROM clientes')
for clientes in dados:
    print(clientes)

(1, 'Maria', 25, 1200.0)
(2, 'Pedro', 30, 1000.0)
(4, 'Teresa', 36, 5700.0)
(5, 'Maria', 25, 1200.0)
(6, 'Pedro', 30, 1000.0)
(7, 'Antonio', 20, 2501.0)
(8, 'Teresa', 36, 5700.0)

8. Junção de Tabelas

Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real)

In [ ]:
cursor.execute('CREATE TABLE compras (id INTEGER PRIMARY KEY AUTOINCREMENT, cliente_id INTEGER, produto VARCHAR (100), valor FLOAT);')

Insira algumas compras associadas a clientes existentes na tabela "clientes"

In [25]:
cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (1, "Notebook", 4000.00)')
cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (2, "Cadeira", 400.00)')
cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (4, "Impressora", 1000.00)')

Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [26]:
# Consulta para exibir o nome do cliente, produto e valor de cada compra
cursor.execute('''SELECT clientes.nome, compras.produto, compras.valor FROM compras JOIN clientes ON compras.cliente_id = clientes.id''')

In [27]:
# Exibindo o resultado
compras = cursor.fetchall()
for compra in compras:
    print(f'Nome do cliente: {compra[0]}, Produto: {compra[1]} e Valor da compra R$ {compra[2]:,.2f}')

Nome do cliente: Maria, Produto: Notebook e Valor da compra R$ 4,000.00
Nome do cliente: Pedro, Produto: Cadeira e Valor da compra R$ 400.00
Nome do cliente: Teresa, Produto: Impressora e Valor da compra R$ 1,000.00
Nome do cliente: Maria, Produto: Notebook e Valor da compra R$ 4,000.00
Nome do cliente: Pedro, Produto: Cadeira e Valor da compra R$ 400.00
Nome do cliente: Teresa, Produto: Impressora e Valor da compra R$ 1,000.00

In [28]:
conexao.commit()
conexao.close()